org-docs/dsa-java-notes/note2.org
#+TITLE: First java program input/output debugging and datatypes

* structure of a java file

- Name: every file that ends with an extensions .java is a class itself; eg: main.java
  1. since it's name is main.java(or some name before ___.java) it should contain a class with that name (as in before the extension) in the file itself
  2. all the code that we'll be writing will be in this class main/name
- the Class in the name: remember if a variable name starts with a capital letter then it is a class name (by convention)
  1. If the class with the name of the file is in the file then that will be a class of the public type , in this case main is the public class type , public class means that this class will be accessible by all other files , classes, etc.
  2. Like cpp , java also has a main function (by convention) from where the program starts , whenever we run the program the compiler will look for main , if it is not present then the compiler will throw error.
  3. You can run with the java compiler "javac" _name_.java and then java _name_ (where name is the class as well as the file name) , also while running the executable(class file) with java you can use the class name only.

** explanation of the main.java file

#+begin_src java
public class main { // inside this block of {} is the int main of java as found in cpp
    public static void main(String[] args) {
        System.out.println("hello world!!");
    }
}
#+end_src
Here class is name group of properties and functions , in the above eg's class we have this function
*** /all about the function/
1. All the functions that are in the classes are knows as methods.
2. Also the function name has to be main only like here " public static void main(String[] args) " it is reserved to be here if it is not main it will not run since main function is the entry point of the function. c) Function is a block/collection of code which can be used again and again.
*** /then rest of the code explanation/
3. Here public means the same as in the class name part " public static void main(String[] args) " since main is necessary to run the program so it makes sense to make it available to be executed from anywhere i.e public class type , if we make it private then it will not be available like the public class and hence it will not be valid.
4. Here static means: this main function/method is a part of the _Main_ class also main is required to be run without creating an object of this Main class ,so we use the static type . Since nothing is running before the main() function then there is no use of making an object there.
5. Static variables and functions are the variables and functions that don't depend on the object.
6. void is the return type of the function, since we don't want any value here so we have used void(like in cpp).
