org-docs/dsa-java-notes/notes/note2.md


<a id="org4583639"></a>

### *how to run*

1.  (String[] args) are the arguments , collection of strings.
2.  here args is the arguments given in the terminal with java command (like java Main 50 100 &#x2026;) after compiling with the javac(like javac Main(class/file name)) and the no inside the [] is the index of the array to which the values given with the java command will be printed , the values given with the java command is stored in the String[] array.
3.  if you use javac -d <span class="underline">directory</span> <span class="underline">name</span>: this -d flag is used to give a directory to store the .class file.
4.  package is the folder where the java file will lie, eg package com.kunal , this com.kunal is a subfolder in the com folder (you can make more of those subfolders) , &rsquo;.&rsquo; period means subfolder.
5.  then comes = System.out.println(&ldquo;hello world!!&rdquo;); this line means (System.out) in the command line do a (.print(<sub>string</sub>\_)) this prints a string in the command line, if we use ctrl/cmd+click on this we get.
    
        /**
         * Prints a String and then terminate the line.  This method behaves as
         * though it invokes {@link #print(String)} and then
         * {@link #println()}.
         *
         * @param x  The {@code String} to be printed.
         */
        public void println(String x) {
            if (getClass() == PrintStream.class) {
                writeln(String.valueOf(x));
            } else {
                synchronized (this) {
                    print(x);
                    newLine();
                }
            }
        }

6.  to print stuff we have the <span class="underline">System</span> class , it is in file called System.java(since System starts with a capital letter hence we know it is a class) in the java.lang package. All the stuff available in the lang package can be accessed in the files created by the people who made java
7.  <span class="underline">println</span> in the above src says that you will give a string and it&rsquo;ll print that string
8.  <span class="underline">out</span> is a variable contained in the System class, it is basically a type of PrintStream(will be expained later), and PrintStream has something called println. out is like a reference variable for PrintStream and by default value of the standard output stream i.e the out is the commandline i.e laptop (idk what that means) or the place where the output will be shown, out&rsquo;s original value is null (like this here) = public static final PrintStream out = null; which means that the output will be in the commandline but if we declare out = <span class="underline">some file or anything</span> then it will take the output of that println into that file or something
9.  **##** so it means System has a variable called out which is of type PrintStream and this out has a method/function called println, since out is of type PrintStream so println is also in PrintStream : in the standard output stream print something

10. **NOTE** some of the reference  which can be added to the code itself instead of here are done in the file mentioned here

11. for <span class="underline">input</span> in Main.java the code: ~ Scanner input = new Scanner(System.in); ~  <span class="underline">Scanner</span> is a public class (it allows us to take input in simple sense) which is a simple text scanner which can parse primitive types and strings using regular expressions, then the <span class="underline">input</span> is a normal declared variable and by using Scanner , this input will read everything we want ,then we add a new object i.e &rsquo;new&rsquo; which is a keyword then Scanner(), in the brackets here we need to pass from where we will pass the input (can be a file or keyboard), we pass the System.in which is used to pass standard input or output (<sub>.in</sub>\_ part refers to the keyboard input) also the default value of System.in is null we can also define it to be something else . object is a type of scanner and it has a value of System.in whenever input asks for something you will take the value from the keyboard this is the meaning ; again scanner is basically a class that specifies an input stream and using the variable (object) of the class we can take input.
    *also look for the main documentation in the IntellijIdea by ctrl+click*
    -   better explanation of the **System** class: The System class contains several useful class fields and methods. It cannot be instantiated. Among the facilities provided by the System class are standard input, standard output, and error output streams; access to externally defined properties and environment variables; a means of loading files and libraries; and a utility method for quickly copying a portion of an array.
    -   and of the **.in** part: The &ldquo;standard&rdquo; input stream. This stream is already open and ready to supply input data. Typically this stream corresponds to keyboard input or another input source specified by the host environment or user. In case this stream is wrapped in a java.io.InputStreamReader, Console.charset() should be used for the charset, or consider using Console.reader().

12. regarding the new keyword , it is used to

13. every class in java extends the object class , eg: Scanner ; important concept
14. about the different next( ,Int,ln) variants
    
        System.out.println(input.nextInt()); // = nextInt prints the integer output
        System.out.println(input.next()); // = next prints the first string(/word) of a sentence of the input in the output
        System.out.println(input.nextln()); // = nextln prints the whole string of a sentence of the input in the output
    
    *input is a variable pointing to the object of scannner class so it&rsquo;ll contain all the functions provided by the scanner class ; whatever input will be given it will be shown in output*


<a id="orgcdbd686"></a>

## All about the datatypes

1.  Primitive data types are the ones which cannot be further broken into other datatypes . eg: &ldquo;Kunal&rdquo; this word can be further divided into individual letters i.e the string can be divided into char , but the char cannot be further divided into other data types, this last datatype which cannot be divided into further data type is known as primitive
2.  **NOTE** To know why we are adding f to float and L to long at their respective end of the data type declaration value , we need to know the size of the bitwise operators ( also the range of them will be in the bitwise operators ),
    for now the size are : int and float has 4 bytes, double and long has 8 bytes
    1.  All the decimal values are of the type <span class="underline">double</span> by default so if there is a need to store them in float then we need to add an &rsquo;f&rsquo; (remember lower case f only) after the end of the value
        *as to why use double instead of float: float gives floating point errors sometimes by rounding off numbers, so to get more accurate value we use double*
        also we can  store larger decimal values using the double type
    2.  And the by default declaration type of integer values is <span class="underline">&ldquo;int&rdquo;</span> so we use &rsquo;L&rsquo; (remember upper case L only) at the end of the long type,
        *why use long instead of int: because it can store more/long integer values*
3.  There contains a class for every data type known as wrapper classes for giving additional funtionality to the primitive datatypes, and they are written as
    
        Integer rollno = 8;
        String name = "tera baap hu";
    
    1.  as you can see it contains the capital first letter which by convention means classes so all the other datatypes are written like the above example ( more on that later on OOPs )
    
    2.  how to <span class="underline">comment</span>:  you can add single line comments using &ldquo;/&rdquo; and multi line comments using the following
        
            /* this is a multi line
            comment
            */
